		УНИВЕРСИТЕТ ИТМО
				КАФЕДРА ВТ









	  		 КУРСОВАЯ РАБОТА 
			ПО БАЗАМ ДАННЫХ
				Первая часть













							Выполнил: Каримов Фаррух
									Рахимов Фаррухруз
							Факультет: ПИиКТ
							Группа: Р3102













					2018 г.
				Статистика спонсоров.
	В данной задаче мы рассматриваем автомобильные гонки. 
	В данном мире проводятся различные гоночные соревнования. 
  Разные соревнования могут проводится в различном формате и у разных соревнований могут быть разные уровни престижа. 
  Соревнования могут проводиться в разных странах и в различных погодных условиях, а также с использованием различных 
  видов трасс ( например грунтовые дороги, асфальтные ) с различной общей длиной. В различных соревнованиях могут быть 
  различные виды призов и наград. Гоночные соревнования проходят при спонсировании некоторым числом компаний.
	В данном мире в гонках участвуют автомобили. Автомобили тут « живые ». 
  Автомобили как и любая другая живая техника в этом мире — появляются ( рождаются ) в заводах. 
  С каждым годом живая техника стареет ( ржавеет ) и выходят более новые и улучшенные модели. 
  Также живая техника состоит из множества деталей и запчастей. 
  Некоторые запчасти могут снять с производства и в таком случае при поломках процесс „ремонта“ - затрудняется. 
  Автомобилям для движения необходимо топливо. 
  В рамках данной задачи нам не особо важен процесс старения живой техники. Нам важнее что в рассматриваемых нами 
  гоночных соревнований могут участвовать автомобили. У автомобилей есть некие пределы ( например скоростные ограничения ). 
	В данном мире есть города, страны, и действия происходят на планете ( в солнечной системе ). 
  Но в рамках данной задачи мы не переходим за пределы планеты ( т. е. техника еще не столь развита для космических гонок ). 
  Разные гонщики на соревнованиях могут представлять разные страны.   
	Также в данном мире есть компании ( фирмы )  которые могут спонсировать участников соревнований ( далее спонсоры ). 
  Причём одна компания в одном соревновании может спонсировать только одного участника. Перед тем как начать спонсировать 
  гонщика, спонсор заключает договор с данным гонщиком на 1 год. В период действия договора гонщик рекламирует и выступает 
  под брендом той компании которая его спонсирует. Договор — может быть расторжен по различным причинам. Спонсор должен 
  предоставить гонщику обслуживающий его персонал на гонках.
	Также в данном мире есть различные компании ( фирмы ) - производящие ( добывающая ) топливо для автомобилей, производящие 
  разные виды запчастей, разные виды резины.  
	Нам необходима возможность получать различные  сведения 
1. о спонсорах, о автомобилях которых они спонсировали.
2. о соревнованиях в которых участвовал данный автомобиль, какое место он занимал на соревнованиях, фирма спонсор данного 
автомобиля на этих соревнованиях?
3. о различных фирмах, год открытия, вид деятельности фирмы, спонсировала ли данная фирма когда-нибудь какого-то гонщика, 
если да то кого и когда?
4.  о различных соревнованиях, в каких городах они проводились и в каких годах, количество проданных билетов на при 
проведении данного соревнования?
5.  о городах и странах, какие соревнования проводились, кто участвовал в гонках проводимых в данной стране или данном 
городе,
