http://abit.ifmo.ru/file/pages/74/Raspisanie_VI_2018.pdf


Фаррух, Добрый день!

Информация для абитуриентов размещена на сайте приёмной комиссии:
https://abit.ifmo.ru/

Документы принимаются с 20 июня 2018 г. и завершается:

- от лиц, поступающих по результатам вступительных испытаний, проводимых
вузом самостоятельно - 10 июля(18:00)
- от лиц, поступающих только по результатам ЕГЭ - 26 июля (18:00)

 
Перечень необходимых документов:

- Личное заявление и Анкета - распечатываются из Личного кабинета;
(https://abit.ifmo.ru/ums/system/login/)
- Копия документа, удостоверяющего личность (страницы с фотографией,
фамилией и именем), и его нотариально заверенный перевод, если он не на
русском языке;
- Документ об образовании (оригинал или нотариально заверенная копия) и
его нотариально заверенный перевод, если он не на русском языке;
- 4 матовые фотографии 3×4 см, цвет или ч/б – на Ваше усмотрение.

Перед въездом в Россию необходимо подготовить следующие медицинские
документы:
• Медицинская справка об отсутствии вируса иммунодефицита человека (ВИЧ)
и заболевания СПИД, выданной официальным органом страны проживания, со
сроком прохождения обследования не более чем за 6 (шесть) месяцев до
первого дня занятий.
• Медицинское заключение об отсутствии противопоказаний для обучения в
Российской Федерации, выданного официальным органом страны проживания
(аналог справки 086/у).
• Сертификат о прививках.
Документы должны быть:
• на русском языке или в официальном заверенном варианте перевода на
русский язык;
• заверены печатями и подписями;
• на бумажном носителе.


С уважением,
М.Ю. Серова


Фаррух Каримов писал 2018-02-15 22:54:
> Доброй ночи.
> Извините пожалуйста, а можете отправить список документов - которые
> надо принести для сдачи вступительных экзаменов?
> Большое спасибо.
>
>
>>Четверг, 15 февраля 2018, 11:13 +03:00 от Marina Serova <serova@mail.ifmo.ru>:
>>
>>Фаррух, Добрый день!
>>
>>Если Ваш друг является иностранным гражданином, он может поступать в
>>Университет по внутренним вступительным испытаниям.
>>С расписанием вступительных испытаний Вы можете ознакомиться здесь:
>>http://abit.ifmo.ru/file/pages/74/Raspisanie_VI_2018.pdf
>>
>>Серебряная медаль с IOI 2016 может быть учтена в качестве индивидуальных
>>достижений и добавить дополнительные баллы (не более 10 баллов).
>>Более подробная информация об индивидуальных достижениях размещена
>>здесь: https://abit.ifmo.ru/page/69/
>>
>>С уважением,
>>М.Ю. Серова
>>
>>
>>
>>
>>>>-------- Исходное сообщение --------
>>>>Тема: Медаль IOI при поступлении в ИТМО.
>>>>Дата: 2018-02-13 16:21
>>>>От: Фаррух Каримов < karimov.farrux@list.ru >
>>>>Кому: serova@mail.ifmo.ru
>>>>
>>>>Добрый день. 
>>>>Скажите пожалуйста, серебряная медаль со Всемирной Олимпиады по
>>>>Информатике ( IOI http://www.ioinformatics.org/index.shtml ).
>>>>Может ли как-нибудь помочь при поступлении в ИТМО? Т.е. у моего друга
>>>>есть серебряная медаль с IOI 2016, он не сдавал ЕГЭ. Как он может
>>>>поступить в ИТМО? Я имею ввиду, без Россотрудничества.
>>>>Спасибо.
>>
>>
